#Рабочая тетрадь 1.2
#Задание 1
def binary_search(list, key):
  low = 0
  high = len(list) - 1
  if len(list) == 0: #Проверка пустого массива
    return 0
  while low <= high:
    mid = low + (high - low) // 2 #середина отрезка (концы которого - это low и high)
    midVal = list[mid] #Элемент в середине отрезка
    if midVal == key: #Проверка, если элемент в середине является элементом, который мы ищем
      return mid
    if midVal > key: #Если искомый элемент меньше середины, значит он слева (сдвигаем правую границу)
      high = mid - 1
    else: #Иначе сдвигаем левую
      low = mid + 1
  if len(list) == 1: #Если в списке только один элемент
    if key < list[0]:
      return 0
    else:
      return 2

  if list[0] < list[-1]: #Если массив отсортирован по возрастанию
    if key < list[0]: #Если искомый элемент меньше первого элемента, значит его можно вставить в начало массива
      return 0
    elif key > list[-1]: #Аналогично с концом массива
      return len(list)
    else:
      for i in range(len(a)-1): #Проходимся по всему массиву и сравниваем предыдущий элемент массива со следующим
        if list[i] < key < list[i+1]:
          return i+1

  elif list[0] > list[-1]: #То же самое, только с убыванием
    if key > list[0]:
      return 0
    elif key < list[-1]:
      return len(list)
    else:
      for i in range(len(a)-1):
        if list[i] > key > list[i+1]:
          return i+1

a = [8, 6, 5, 4, 3, 2, 1]
b = [1, 2, 4, 5, 6, 7, 8]
c = [1]
d = [1, 1, 1, 3, 4]
print(binary_search(a, 7))
print(binary_search(b, 3))
print(binary_search(c, 0))
print(binary_search(d, 2))
#Результат выполнения - 1/2/0/3 (программа работает со всеми случаями)


#Задание 2

def peak_search(arr):
  if len(arr) < 3: #Проверка длины массива
    print("Массив не горный")
  low = 0
  high = len(arr) - 1
  while low < high:
    mid = low + (high - low) // 2 #Середина массива
    if arr[mid] < arr[mid+1]: #Сравниваем средний элемент массива со следующим
      low = mid + 1 #Пик находится справа, сдвигаем левую границу
    else:
      high = mid #Иначе пик слева, двигаем правую границу
    
  if low == 0 or low == len(arr) - 1: #Пик не может быть первым или последним элементом
    return "Массив не горный"
    
  for i in range(low): #Проверяем строгое возрастание до пика, иначе массив не горный
    if arr[i] >= arr[i+1]:
      return "Массив не горный"
    
  for i in range(low, len(arr)-1): #Проверяем строгое убывание после пика, иначе массив не горный
    if arr[i] <= arr[i+1]:
      return "Массив не горный"

  return low #Если все верно выводим индекс пика

a1 = [0, 2, 4, 3, 1]
print(peak_search(a1)) #Вывод - 2

a2 = [0, 1, 2, 2, 1]
print(peak_search(a2)) #Вывод - Массив не горный

#Задание 3

def neg(arr):
  negative = 0 #Количетсво отрицательных чисел

  low = 0
  high = len(arr) - 1

  while low <= high:
    mid = low + (high - low) // 2 #Середина массива
    if arr[mid] < 0: #Если центральный элемент массива меньше 0, то все остальные элементы до него тоже меньше нуля, поскольку массив отсортирован по возрастанию
      negative = mid + 1
      low = mid + 1 #Сдвигаем левую границу, чтобы проверить, есть ли отрицательные элементы справа от середины массива
    else:
      high = mid - 1 #Иначе сдвигаем правую границу, чтобы найти отрицательный элемент
  return negative

def pos(arr):
  first = -1 #Позиция первого положительного элемента последовательности

  low = 0
  high = len(arr) - 1

  while low <= high:
    mid = low +  (high - low) // 2 #Опять же его середина
    if arr[mid] > 0: #Если центральный элемент массива больше нуля
      high = mid - 1 #То мы сдвигаем правую границу, чтобы найти самый первый положительный элемент
      first = mid #Сохраняем его индекс
    else:
      low = mid + 1 #Иначе сдвигаем левую границу, чтобы опять же найти первый положительный элемент
  if first == -1:
    return 0
  return len(arr) - first

a = [-5, -3, -1, 0, 0, 2, 4, 6, 8]
if a: #Проверка массива, пустой он или нет и дальнейшее сравнение количества положительных/отрицательных элементов в массиве
  if neg(a) > pos(a):
    print("Отрицательных чисел больше:", neg(a))
  elif neg(a) < pos(a):
    print("Положительных чисел больше:", pos(a))
  else:
    print("Положительных и отрицательных чисел одинаковое количество:", pos(a))
else:
  print("Пустой массив")
#Вывод - Положительных и отрицательных чисел одинаковое количество: 3


#Задание 4
def bin_search(arr, x): #Функция вставки элемента в массив
  low = 0
  high = len(arr)

  while low < high:
    mid = low + (high - low) // 2
    if arr[mid] < x: #Все элементы слева и сам arr[mid] меньше x - нужно искать правее
      low = mid + 1
    else: #Иначе искомая позиция находится на mid или левее
      high = mid
  return low #В таком случае low и будет индексом вставки


def find_lower(arr):
  counts = [] 
  checked = [] #Список рассмотренных элементов
  for i in reversed(arr): #Проверяем массив справа налево
    id = bin_search(checked, i) #Находим индекс вставки с помощью бинарного поиска
    counts.append(id) #Индекс вставки совпадает с количеством элементов, меньших i, поэтому добавляем его в ответ
    checked.insert(id, i) #Вставляем элемент по индексу
    print(i, id, checked, counts) #Просто смотрел как это работает
  return counts[::-1] #Разворачиваем ответ, так как мы шли справа налево

a = [5, 2, 6, 1]
print(find_lower(a)) #Вывод - [2, 1, 1, 0]
